---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionPerpendicularToView
source: html/51906503-9040-9c79-aff3-403632b81f1f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionPerpendicularToView Property

The Dimension is perpendicular to the current view, and no longer valid.

## Syntax (C#)
```csharp
public static FailureDefinitionId DimensionPerpendicularToView { get; }
```